load-test.yml
config:
  environments:
    dev:
      target: "https://uni-ooi-giga-meter-backend-dev.azurewebsites.net"
      phases:
        - duration: 30   # 5 minutes
          arrivalRate: 500  # 50 users per second
          rampTo: 200      # Ramp up to 100 users per second
      defaults:
        headers:
          Authorization: "Bearer YOUR_PROD_ACCESS_TOKEN"
          Content-Type: "application/json"

    prod:
      target: "https://uni-ooi-giga-meter-backend-prod.azurewebsites.net"
      phases:
        - duration: 300   # 5 minutes
          arrivalRate: 100 # 100 users per second
          rampTo: 200      # Ramp up to 200 users per second
      defaults:
        headers:
          Authorization: "Bearer YOUR_PROD_ACCESS_TOKEN"
          Content-Type: "application/json"

variables:
    country: ["", "BRA", "IND", "USA", "GBR", ""]
    filter: ["timestamp", "created_at", ""]

scenarios:
  - flow:
      - get:
          url: "/api/v1/measurements"